src/Catalogs/ит_ИнформационныеБазы1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ит_ИнформационныеБазы1С</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерверныйРежим</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайловойБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияПоComConnector</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ит_ИнформационныеБазы1С/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{Режим открытия окна
	#Если ВебКлиент Тогда
		ЭтоВебКлиент=Истина;
	#Иначе
		ЭтоВебКлиент=Ложь;
	#КонецЕсли
	НайденныйРежимОткрытияОкна=аДООбщееСерверПС.ПолучитьРежимОткрытияФормы(ЭтаФорма.ИмяФормы, , ЭтоВебКлиент);
	Если НайденныйРежимОткрытияОкна<>Неопределено Тогда
		ЭтаФорма.РежимОткрытияОкна=НайденныйРежимОткрытияОкна;
	КонецЕсли;
	//}
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ТипПлатформы=Перечисления.аТипыПлатформы.Предприятие83;
		Объект.ВариантАвторизации=Перечисления.аДОВариантыАвторизации.ОбщийЛогинИПароль;
	КонецЕсли;
	
	УстановитьОтображениеАутентификации();
	УстановитьОформлениеНастройкиСинхронизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СерверныйРежимПриИзменении(Элемент)
	УстановитьОтображениеЭлементов();
	УстановитьОформлениеНастройкиСинхронизации();
	
КонецПроцедуры

Процедура УстановитьОтображениеЭлементов()
	Если Объект.СерверныйРежим =1 Тогда
		Элементы.ПутьКФайловойБазе.Видимость=Истина;
		Элементы.ИмяСервера.Видимость=Ложь;
		Элементы.ИмяБазыДанных.Видимость=Ложь;
	ИначеЕсли Объект.СерверныйРежим =0 Тогда
		Элементы.ПутьКФайловойБазе.Видимость=Ложь;
		Элементы.ИмяСервера.Видимость=Истина;
		Элементы.ИмяБазыДанных.Видимость=Истина;
	ИначеЕсли Объект.СерверныйРежим =2 или  Объект.СерверныйРежим =3 Тогда
		Элементы.ПутьКФайловойБазе.Видимость=Ложь;
		Элементы.ИмяСервера.Видимость=Истина;
		Элементы.ИмяБазыДанных.Видимость=Истина;
		Элементы.Ресурс.Видимость=Истина;
		Элементы.ТипПлатформы.Видимость=Ложь;
		Элементы.ГруппаНастройкаСинхронизации.Видимость=Ложь;
	КонецЕсли;	
	
	//Элементы.Пароль.Доступность=НЕ Объект.УказыватьПарольПриСоединении;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеСБазойДанных(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сначала запишите элемент';en='Save element first.';"),,аОбщееКлиентПС.ЗаголовокДиалога());
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьСоединениеСБазойДанныхЗавершение", ЭтотОбъект), НСтр("en='Directory entry will be saved. Do you want to continue?';ru='Элемент справочника будет записан! Продолжить?'"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли; // новый элемент
	
	ПроверитьСоединениеСБазойДанныхФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеСБазойДанныхЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
        Возврат;
    Иначе
        Попытка		
            Записать();
        Исключение
            аДООбщееКлиент.СообщитьОбОшибке(ОписаниеОшибки());
            Возврат
        КонецПопытки;
    КонецЕсли; // запись нового элемента;
    
    ПроверитьСоединениеСБазойДанныхФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединениеСБазойДанныхФрагмент()
    
    Если аДОРаботаСВнешнимиБазами.ИнициализироватьСоединениеСБазойДанных(Объект.Ссылка) Тогда
        ПоказатьПредупреждение(Неопределено, НСтр("en='Connection is successful.';ru='Соединение успешно установлено.'"), 60, аОбщееКлиентПС.ЗаголовокДиалога());
        
    Иначе
        ПоказатьПредупреждение(Неопределено, НСтр("en='Error establishing a connection with ""';ru='Ошибка установки соединения с ""'")+СокрЛП(Объект.Наименование)+""".", 60, аОбщееКлиентПС.ЗаголовокДиалога());
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайловойБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	//выберем путь к информационной базе
	
	ДиалогВыборкаКаталога=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыборкаКаталога.Каталог=Объект.ПутьКФайловойБазе;
	ДиалогВыборкаКаталога.ПолноеИмяФайла = "";
	Фильтр = НСтр("en='All files (*. *) | *. *';ru='Все файлы(*.*)|*.*'");
	ДиалогВыборкаКаталога.Фильтр = Фильтр;
	ДиалогВыборкаКаталога.МножественныйВыбор = Ложь;
	ДиалогВыборкаКаталога.Заголовок = НСтр("en='Select the directory information database';ru='Выберите каталог информационной базы данных'");
	
	Если ДиалогВыборкаКаталога.Выбрать() Тогда
		ПутьКБазеДанных=ДиалогВыборкаКаталога.Каталог;
	
		// Добавляем слэш в конце, если его нет
		Если Прав(ПутьКБазеДанных,1) <> "\" Тогда
			ПутьКБазеДанных=ПутьКБазеДанных+ "\";
		КонецЕсли;
		
		Объект.ПутьКФайловойБазе=ПутьКБазеДанных;
		Модифицированность=Истина;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура НеСохранятьПарольПриИзменении(Элемент)
//	
//	Элементы.Пароль.Доступность=НЕ Объект.УказыватьПарольПриСоединении;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ИспользоватьАутентификациюОперационнойСистемыПриИзменении(Элемент)
//	УстановитьОтображениеАутентификации();
//	
//КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеАутентификации()
	Если Объект.ВариантАвторизации=Перечисления.аДОВариантыАвторизации.АутентификацияОперационнойСистемы Тогда
		Элементы.ГруппаПодключениеПоЗаданномуЛогинуИПаролю.Видимость=Ложь;
		Элементы.ГруппаПодключениеПоОбщемуЛогину.Видимость=Ложь;
		Элементы.ГруппаПодключениеОперационнойСистемой.Видимость=Истина;
						
	ИначеЕсли Объект.ВариантАвторизации=Перечисления.аДОВариантыАвторизации.ОбщийЛогинИПароль Тогда
		Элементы.ГруппаПодключениеПоЗаданномуЛогинуИПаролю.Видимость=Ложь;
		Элементы.ГруппаПодключениеПоОбщемуЛогину.Видимость=Истина;
		Элементы.ГруппаПодключениеОперационнойСистемой.Видимость=Ложь;
		
	ИначеЕсли Объект.ВариантАвторизации=Перечисления.аДОВариантыАвторизации.ЗаданныйЛогинИПароль Тогда
		Элементы.ГруппаПодключениеПоЗаданномуЛогинуИПаролю.Видимость=Истина;
		Элементы.ГруппаПодключениеПоОбщемуЛогину.Видимость=Ложь;
		Элементы.ГруппаПодключениеОперационнойСистемой.Видимость=Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияПоComConnectorПриИзменении(Элемент)
	УстановитьОформлениеНастройкиСинхронизации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеНастройкиСинхронизации() 
	Если Объект.ТипПлатформы=Перечисления.аТипыПлатформы.Предприятие83 И Объект.СерверныйРежим=0 Тогда
		Объект.СинхронизацияПоComConnector=Истина;
		Элементы.СинхронизацияПоComConnector.ТолькоПросмотр=Истина;
	Иначе
		Элементы.СинхронизацияПоComConnector.ТолькоПросмотр=Ложь;
	КонецЕсли;
	
	Элементы.ДекорацияComConnector.Доступность=Объект.СинхронизацияПоComConnector;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатформыПриИзменении(Элемент)
	УстановитьОформлениеНастройкиСинхронизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("НастройкаИнформационнойБазы", "Записано", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантАвторизацииПриИзменении(Элемент)
	УстановитьОтображениеАутентификации();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиПодключения(Команда)
	ПараметрыФормы = Новый Структура("ИнформационнаяБаза", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.аПодключенияКВнешнимБазам.ФормаСписка", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
